In [69]:
# Import Dependencies

import pandas as pd
import matplotlib.pyplot as plt 
username = 'USERNAME'
password ='PASSWORD'
%matplotlib inline

# Tried importing ForeignKey, ForeignKeyConstraint, composite, relationship per documentation to read tables with composite keys as PK... not working
import sqlalchemy
from sqlalchemy import Column, Integer, String, Float, ForeignKey, ForeignKeyConstraint
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session, composite, relationship
from sqlalchemy import create_engine, inspect

# Create engine
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/HP_Employees')
connection = engine.connect()

In [70]:
# Get table names using inspector

inspector = inspect(engine)
inspector.get_table_names()

['Departments', 'Titles', 'Employees', 'Dept_Emp', 'Dept_Manager', 'Salaries']

In [71]:
# Reflect DB into classes

Base = automap_base()
Base.prepare(engine, reflect=True)

In [72]:
# Print classes NOTE: Dept_Emp and Dept_Manager are tables with composite keys as primary keys... can't get them to reflect as classes using Automap...

Base.classes.keys()

['Departments', 'Titles', 'Employees', 'Salaries']

In [74]:
# Assign keys to variables

Employees = Base.classes.Employees
Departments = Base.classes.Departments
Titles = Base.classes.Titles
Salaries = Base.classes.Salaries

In [75]:
# Create session to query DB

session = Session(bind=engine)

In [76]:
# Query Employees and create DataFrame

query_emp = session.query(Employees)
emp_df = pd.read_sql_query(query.statement, session.get_bind())
emp_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18